ams/src/InformationRegisters/AMS_ИсторияРеализации/AMS_ИсторияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ИсторияРеализации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.AMS_СобытияРеализации</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <types>EnumRef.AMS_СтатусыРеализаций</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийЛист</name>
    <type>
      <types>DocumentRef.AMS_ЛогистическийЛист</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/AMS_ИсторияРеализации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает событие документа
// 
// Параметры:
//  Документ - ДокументСсылка.ПередачаТоваровХранителю, ДокументСсылка.РеализацияТоваровУслуг - документ.
//	Событие - ПеречислениеСсылка.AMS_СобытияРеализации - событие документа.
//  ВремяНачалаСобытия - Дата - время открытия документа
//	ЛогистическийЛист - ДокументСсылка.AMS_ЛогистическийЛист
//
Процедура ЗаписатьСобытиеДокумента(Документ, Событие, ВремяНачалаСобытия = Неопределено, ЛогистическийЛист = Неопределено) Экспорт 
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		СтрДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"AMS_СтатусРеализации,Проведен,Партнер,СуммаДокумента");
	Иначе
		СтрДок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,"Проведен,Партнер,СуммаДокумента");
		СтрДок.Вставить("AMS_СтатусРеализации",?(СтрДок.Проведен,"К отгрузке","В работе"));
	КонецЕсли;	
	
	Если ЛогистическийЛист = Неопределено Тогда
		Данные = AMS_ВызовСервера.ПолучитьЛогистическийЛистРасходныйОрдер(Документ);
		ЛогистическийЛист = Данные.ЛогистическийЛист;
	КонецЕсли;	

	Запись = СоздатьМенеджерЗаписи();
	
	Запись.Период            = ТекущаяДатаСеанса();
	
	Запись.Документ          = Документ;
	
	Запись.Событие           = Событие;
	Запись.Исполнитель       = Пользователи.ТекущийПользователь();
	Запись.Проведен          = СтрДок.Проведен;
	Запись.Статус            = СтрДок.AMS_СтатусРеализации;
	Запись.Партнер           = СтрДок.Партнер;
	Запись.СуммаДокумента    = СтрДок.СуммаДокумента;
	Запись.ВремяОбработки    = ?(ВремяНачалаСобытия = Неопределено, 0, ТекущаяДатаСеанса() - ВремяНачалаСобытия);
	Запись.ЛогистическийЛист = ЛогистическийЛист;
	
	Запись.Записать(); 
КонецПроцедуры


#КонецОбласти

#КонецЕсли
